Flow Past Square/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       109300;
    }
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       109450;
    }
    sides
    {
        type            patch;
        nFaces          800;
        startFace       109600;
    }
    square
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       110400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          110000;
        startFace       110700;
    }
)

// ************************************************************************* //
