Flow Past Square/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
(0 0 0) // 0
(9 0 0) // 1
(10 0 0) // 2
(42 0 0) // 3
(42 6.5 0) // 4
(42 7.5 0) // 5
(42 14 0) // 6
(10 14 0) // 7
(9 14 0) // 8
(0 14 0) // 9
(0 7.5 0) // 10
(0 6.5 0) // 11
(9 6.5 0) // 12
(10 6.5 0) // 13
(10 7.5 0) // 14
(9 7.5 0) // 15
(0 0 1) // 16
(9 0 1) // 17
(10 0 1) // 18
(42 0 1) // 19
(42 6.5 1) // 20
(42 7.5 1) // 21
(42 14 1) // 22
(10 14 1) // 23
(9 14 1) // 24
(0 14 1) // 25
(0 7.5 1) // 26
(0 6.5 1) // 27
(9 6.5 1) // 28
(10 6.5 1) // 29
(10 7.5 1) // 30
(9 7.5 1) // 31
);

blocks
(
hex (0 1 12 11 16 17 28 27) (100 50 1) simpleGrading (1 1 1) // 1
hex (11 12 15 10 27 28 31 26) (100 50 1) simpleGrading (1 1 1) // 2
hex (10 15 8 9 26 31 24 25) (100 50 1) simpleGrading (1 1 1) // 3
hex (15 14 7 8 31 30 23 24) (100 50 1) simpleGrading (1 1 1) // 4
hex (1 2 13 12 17 18 29 28) (100 50 1) simpleGrading (1 1 1) // 5
hex (14 5 6 7 30 21 22 23) (200 50 1) simpleGrading (4 1 1) // 6
hex (13 4 5 14 29 20 21 30) (200 50 1) simpleGrading (4 1 1) // 7
hex (2 3 4 13 18 19 20 29) (200 50 1) simpleGrading (4 1 1) // 8
);

edges
(
);

boundary
(
outlet
{
type patch;
faces
(
(3 4 20 19)
(4 5 21 20)
(5 6 22 21)
) ;
}
inlet
{
type patch;
faces
(
(11 0 16 27)
(10 11 27 26)
(9 10 26 25)
);
}
sides
{
type patch;
faces
(
(6 7 23 22)
(7 8 24 23)
(8 9 25 24)
(0 1 17 16)
(1 2 18 17)
(2 3 19 18)
);
}
square
{
type wall;
faces
(
(15 12 28 31)
(14 15 31 30)
(12 13 29 28)
(13 14 30 29)
);
}
);

mergePatchPairs
(
);

// ************************************************************************* //
