Flow Past Square/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         120;

deltaT          0.02;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 0.5;

libs ("libforces.so" "libOpenFOAM.so" "libfieldFunctionObjects.so");
functions
{
    readFields
    {
        functionObjectLibs ("libfieldFunctionObjects.so");
        type readFields;
        fields (p U);
    }
    forces
    {
        type forceCoeffs;
        functionObjectLibs ("libforces.so");
        outputControl outputTime;
        writeInterval 0.01;
        patches ("square");
        pName p;
        UName U;
        rho rhoInf;
        log true;
        rhoInf 1;
        liftDir (0 1 0);
        dragDir (1 0 0);
        CofR (0 0 0);
        pitchAxis (0 1 0);
        magUInf 1.0;
        lRef 1.0;
        Aref 1.0;
    }
}


// ************************************************************************* //
